## Production: stepfunctions 🤖
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                    |
|--------|-------------------------------------------|
| update | `aws_iam_policy.eventbridge_sfn_policy`   |
|        | `aws_sfn_state_machine.data_orchestrator` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.eventbridge_sfn_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "eventbridge_sfn_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:states:ca-central-1:739275439843:stateMachine:DataLakeOrchestrator",
            ]
        }
    }

  # aws_iam_policy.eventbridge_sfn_policy will be updated in-place
  ~ resource "aws_iam_policy" "eventbridge_sfn_policy" {
        id               = "arn:aws:iam::739275439843:policy/DataLakeOrchestratorEventBridgePolicy"
        name             = "DataLakeOrchestratorEventBridgePolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:739275439843:stateMachine:DataLakeOrchestrator"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_sfn_state_machine.data_orchestrator will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_orchestrator" {
      ~ definition                = jsonencode(
          ~ {
              ~ States  = {
                  + ParallelCuratedJobs     = {
                      + Branches = [
                          + {
                              + StartAt = "StartGCNotifyCuratedJob"
                              + States  = {
                                  + GCNotifyCuratedJobFailed = {
                                      + End    = true
                                      + Result = "GC Notify Curated Glue job failed"
                                      + Type   = "Pass"
                                    }
                                  + StartGCNotifyCuratedJob  = {
                                      + Catch      = [
                                          + {
                                              + ErrorEquals = [
                                                  + "States.ALL",
                                                ]
                                              + Next        = "GCNotifyCuratedJobFailed"
                                            },
                                        ]
                                      + End        = true
                                      + Parameters = {
                                          + JobName = "Platform / GC Notify / Curated / Notification Enriched"
                                        }
                                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                                      + Type       = "Task"
                                    }
                                }
                            },
                        ]
                      + Next     = "AllJobsComplete"
                      + Type     = "Parallel"
                    }
                  ~ ParallelTransformedJobs = {
                      ~ Next     = "AllJobsComplete" -> "ParallelCuratedJobs"
                        # (2 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id                        = "arn:aws:states:ca-central-1:739275439843:stateMachine:DataLakeOrchestrator"
        name                      = "DataLakeOrchestrator"
        tags                      = {}
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.data_orchestrator_schedule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.eventbridge_sfn_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sfn_glue_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.eventbridge_sfn_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sfn_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_sfn_state_machine.data_orchestrator"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
